{
  "de": {
    "page_title": "Naim El Amri - Portfolio",
    "home": "Home",
    "about": "Über mich",
    "projects": "Projekte",
    "skills": "Fähigkeiten",
    "experience": "Erfahrungen",
    "hero_title": "Naim El Amri Fernandez",
    "hero_subtitle": "Developer by Craft. Creator by Nature.",
    "about_title": "Über mich",
    "about_greeting": "Hallo, ich bin Naim! 🎋",
    "about_description": "Ich bin Informatiker EFZ mit Fachrichtung Applikationsentwicklung, begeistere mich für durchdachte Lösungen und habe ein gutes Gespür für funktionale wie auch visuell ansprechende Anwendungen. Ob im Frontend oder Backend – ich finde mich super schnell in neue Themen ein und arbeite gerne im Team, wo ich meine Stärke fürs vernetzte Denken einbringen kann. Technik, Fotografie und Bewegung inspirieren mich, sei es beim Coden, beim Festhalten besonderer Momente oder beim Auspowern im Gym.",
    "about_motivation": "Was mich begeistert ⭐️",
    "about_motivation_text": "Ich liebe es, digitale Ideen zum Leben zu erwecken – mit einem Auge fürs Detail und einem offenen Blick für neue Entwicklungen. Besonders spannend finde ich, wie moderne Webtechnologien und KI unsere digitalen Erlebnisse formen und verbessern können. Ob Frontend oder Backend, ich schätze durchdachten Code genauso wie kreative Lösungsansätze. Neben dem Programmieren ist die Fotografie meine Art, abzuschalten und die kleinen, schönen Dinge im Leben bewusst wahrzunehmen und festzuhalten. Und wenn der Kopf mal zu voll ist, hilft mir ein Workout, den Fokus wiederzufinden.",
    "projects_title": "Projekte",
    "projects_description": "Eine Auswahl an Projekten aus den Bereichen IT und Multimedia, bei denen ich mein technisches Know-how und meine kreative Ader einbringenkonnte.",
    "project_ave_title": "Interview-Porträt: Skater mit Leidenschaft",
    "project_ave_desc": "Ein Filmisches Porträt das sich über meinen Bruder und seine Leidenschaft fürs Skaten handelt. Konzept, Kamera, Ton und Schnitt zusammen mit Robin Luijten, Ali Tas und Nathalie Tschanz realisiert.",
    "project_im_title": "Webauftrit für imaginäres Startup ZenWay",
    "project_im_desc": "Eine minimalistische Corporate-Website, die ich von Grund auf mit HTML und CSS umgesetzt habe – mit Fokus auf klare Struktur, moderne Typografie und responsive Gestaltung.",
    "project_insta_title": "Mein persönliches Instagram Portfolio",
    "project_insta_desc": "Auf Instagram zeige ich meine Vorliebe für die Fotografie und Storytelling in Form von ästhetischen Bildern und kurzen Reels. Mein Ausstellungstisch im Internet, auf dem ich zeige, was mich kreativ antreibt.",
    "projects_link_ave": "Zum Konzept",
    "projects_link_im": "Zur Webseite",
    "projects_link_insta": "Auf Instagram ansehen",
    "skills_title": "Skills Overview",
    "skills_description": "Hier ein Überblick über meine technischen Fähigkeiten. Ich habe praktische Erfahrung sowohl in der Frontend- als auch in der Backend-Entwicklung und erweitere ständig meine Wissen in neuen Technologien und Methoden.",
    "skills_frontend": "Frontend",
    "skills_backend": "Backend",
    "skills_methods": "Arbeitsweisen",
    "skills_agile": "Agile Development",
    "skills_git": "Git & Version Control",
    "skills_software": "Software",
    "experience_title": "Erfahrung",
    "experience_webid_title": "Mediamatiker | Web-ID",
    "experience_webid_date": "August 2024 (1 Monat)",
    "experience_webid_text": "Bei der Web-ID habe ich Kundenseiten mit CMS-Tools wie Typo3 und WordPress angepasst und individuelle Frontend-Anpassungen umgesetzt. Zudem war ich für die Betreuung der Domains verantwortlich und stellte sicher, dass alle Webauftritte reibungslos funktionierten. Um Kunden eine einfache Verwaltung ihrer Webseiten zu ermöglichen, habe ich ein Benutzerhandbuch in InDesign erstellt, das wichtige Funktionen und Workflows verständlich erklärt.",
    "experience_brocki_title": "Auslandsaufenthalt & Zivildienst",
    "experience_brocki_date": "März 2024 - Juli 2024 (5 Monate)",
    "experience_brocki_text": "Während meines Zivildienstes bei der Heilsarmee Brocki in Biel war ich in der Kundenbetreuung und Warenlogistik tätig. In dieser Zeit konnte ich meine Teamfähigkeit, mein Verantwortungsbewusstsein und meine Kommunikationsfähigkeiten ausbauen. Danach reiste ich selbstorganisiert durch Ostasien, wo ich eine völlig neue Kulturen entdeckte, meine Anpassungsfähigkeit stärkte und wertvolle Erfahrungen in der Planung und Selbstständigkeit sammelte.",
    "experience_proalpha_title": "IT Consultant | proALPHA",
    "experience_proalpha_date": "November 2022 - Februar 2024 (1 Jahr, 4 Monate)",
    "experience_proalpha_text": "Bei proALPHA war ich als IT-Consultant tätig und beschäftigte mich mit der technischen Spezifikation, Implementierung und Wartung von kundenspezifischen Anpassungen im ERP-System. Ich analysierte Fehler, entwickelte individuelle Lösungen und stellte sicher, dass Kundenanforderungen effizient umgesetzt wurden. Dabei konnte ich meine analytischen Fähigkeiten und mein technisches Verständnis weiterentwickeln. Durch meine strukturierte und lösungsorientierte Arbeitsweise stellte ich eine hohe Qualität sicher und arbeitete eng mit Kunden sowie internen Teams zusammen.",
    "experience_swisscom_title": "DevOps Engineer | Swisscom",
    "experience_swisscom_date": "August 2021 - Juli 2022 (1 Jahr)",
    "experience_swisscom_text": "Während meines Praktikums bei Swisscom lag mein Fokus auf der Automatisierung von Prozessen. Ich entwickelte Skripte in Python, arbeitete mit Automic und unterstützte die Wartung sowie Verwaltung von Automatisierungsprozessen. Durch meine Tätigkeit in einem agilen Umfeld nach SAFe konnte ich wertvolle Erfahrungen im Bereich Prozessoptimierung und moderne Arbeitsmethoden sammeln. Besonders spannend fand ich die Möglichkeit, eigenständig Lösungen zu entwickeln und mich intensiv mit aktuellen Technologien auseinanderzusetzen."
  },
  "en": {
    "page_title": "Naim El Amri - Portfolio",
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "skills": "Skills",
    "experience": "Experience",
    "hero_title": "Naim El Amri Fernandez",
    "hero_subtitle": "Developer by Craft. Creator by Nature.",
    "about_title": "About Me",
    "about_greeting": "Hello, I'm Naim! 🎋",
    "about_description": "I am a developer with a Swiss Certificate of Competence specialized in application development. I’m passionate about well-designed solutions and have a strong sense for creating both functional and visually appealing applications. Whether it’s frontend or backend, I quickly get up to speed with new topics and enjoy contributing my strength in systems thinking within a team. I’m inspired by technology, photography, and some movement—whether I’m coding, capturing unique moments, or working out at the gym.",
    "about_motivation": "What drives me ⭐️",
    "about_motivation_text": "I love bringing digital ideas to life—with an eye for detail and a curious mind for new trends. I’m especially fascinated by how modern web technologies and AI are shaping and enhancing our digital experiences. Whether it’s frontend or backend, I value clean, thoughtful code just as much as creative problem-solving. Outside of coding, photography is my way to unwind and appreciate the small, beautiful moments in life. And when my head gets too full, a good workout helps me reset and refocus.",
    "projects_title": "Projects",
    "projects_description": "A selection of IT and multimedia projects where I combined tech skills with creativity.",
    "project_ave_title": "Interview Portrait: Skater with Passion",
    "project_ave_desc": "A short film portrait of my brother and his passion for skating. Concept, camera, sound and editing by Robin Luijten, Ali Tas, Nathalie Tschanz and me.",
    "project_im_title": "Website for imaginary startup ZenWay",
    "project_im_desc": "A clean, minimalist corporate site I built from scratch using HTML and CSS – with a clear layout, modern typography, and fully responsive design.",
    "project_insta_title": "My personal photo portfolio on Instagram",
    "project_insta_desc": "On Instagram I share my passion for photography and storytelling through aesthetic images and short reels – my creative online showcase.",
    "projects_link_ave": "To the Concept",
    "projects_link_im": "View Website",
    "projects_link_insta": "View on Instagram",
    "skills_title": "Skills Overview",
    "skills_description": "Here is an overview of my technical skills. I have hands-on experience with both frontend and backend development, and I’m constantly expanding my knowledge in various technologies and methodologies.",
    "skills_frontend": "Frontend",
    "skills_backend": "Backend",
    "skills_methods": "Work Methods",
    "skills_agile": "Agile Development",
    "skills_git": "Git & Version Control",
    "skills_software": "Software",
    "experience_title": "Experience",
    "experience_webid_title": "Mediamatiker | Web-ID",
    "experience_webid_date": "August 2024 (1 Month)",
    "experience_webid_text": "At Web-ID, I adapted customer sites with CMS tools such as Typo3 and WordPress and implemented individual front-end customizations. I was also responsible for managing the domains and made sure that all websites ran smoothly. To make it easy for customers to manage their websites, I created a user manual in InDesign that explains important functions and workflows in an easy-to-understand way.",
    "experience_brocki_title": "Stay Abroad & Community Service",
    "experience_brocki_date": "March 2024 - July 2024 (5 Months)",
    "experience_brocki_text": "During my community service at the Brocki in Biel, I worked in customer service and goods logistics. During this time I was able to develop my teamwork skills, my sense of responsibility and my communication skills. Afterwards, I traveled through East Asia on my own, where I discovered completely new cultures, strengthened my adaptability and gained valuable experience in planning and independence.",
    "experience_proalpha_title": "IT Consultant | proALPHA",
    "experience_proalpha_date": "November 2022 - February 2024 (1 Year, 4 Months)",
    "experience_proalpha_text": "At proALPHA, I worked as an IT consultant and dealt with the technical specification, implementation and maintenance of customer-specific adaptations in the ERP system. I analyzed errors, developed individual solutions and ensured that customer requirements were implemented efficiently. In doing so, I was able to further develop my analytical skills and my technical understanding. Thanks to my structured and solution-oriented way of working, I ensured high quality and worked closely with customers and internal teams.",
    "experience_swisscom_title": "DevOps Engineer | Swisscom",
    "experience_swisscom_date": "August 2021 - July 2022 (1 Year)",
    "experience_swisscom_text": "During my internship at Swisscom, my focus was on the automation of processes. I developed scripts in Python, worked with Automic and supported the maintenance and management of automation processes. By working in an agile environment according to SAFe, I was able to gain valuable experience in process optimization and modern working methods. I found the opportunity to develop solutions independently and deal intensively with current technologies particularly exciting."
  }
}
